django_cscwrapper/templates/AvailableSearches.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eser="http://eservices.cscfinancialonline.com/">
    <soap:Header />
    <soap:Body>
        <AvailableSearches xmlns="https://eservices.cscfinancialonline.com/">
            <params>
                <param name="loginGuid">{{ guid }}</param>
                <param name="contactNo">{{ contact_no }}</param>
                {% if state %}<param name="stateCD">{{ state }}</param>{% endif %}
                {% if search_type %}<param name="searchType">{{ search_type }}</param>{% endif %}
                {% if is_online %}<param name="isOnline">{{ is_online }}</param>{% endif %}
            </params>
        </AvailableSearches>
    </soap:Body>
</soap:Envelope>